import numpy as np

# Создаем матрицу коэффициентов
A = np.array([[1, 1, 1, 1, 5],
              [1, 1, 1, 5, 0],
              [1, 1, 5, 0, 0],
              [1, 5, 0, 0, 0],
              [5, 0, 0, 0, 0]])

# Создаем вектор правой части уравнений
B = np.array([1, 1, 1, 1, 1])

# Метод последовательного исключения переменных
x1 = B[4] / A[4, 0]  # Из последнего уравнения
x2 = (B[3] - A[3, 0] * x1) / A[3, 1]  # Из предпоследнего уравнения
x3 = (B[2] - A[2, 0] * x1 - A[2, 1] * x2) / A[2, 2]  # И т.д.
x4 = (B[1] - A[1, 0] * x1 - A[1, 1] * x2 - A[1, 2] * x3) / A[1, 3]
x5 = (B[0] - A[0, 0] * x1 - A[0, 1] * x2 - A[0, 2] * x3 - A[0, 3] * x4) / A[0, 4]

solution2 = np.array([x1, x2, x3, x4, x5])

print('решение:')
for i in range(len(solution2)):
    print("x" + str(i+1) + " =", solution2[i])

